       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANKING.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 BALANCE PIC S9(7)V99 COMP-3.
       01 WITHDRAWAL PIC 9(5)V99.

       PROCEDURE DIVISION.

           MOVE 5000 TO BALANCE
           MOVE 100 TO WITHDRAWAL
           COMPUTE BALANCE = BALANCE - WITHDRAWAL
           DISPLAY BALANCE
           STOP RUN.
