       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYROLL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 EMPLOYEE-ID PIC 9(5).
       01 HOURS-WORKED PIC 9(3)V99.
       01 HOURLY-RATE PIC 9(3)V99.
       01 GROSS-PAY PIC 9(5)V99.

       PROCEDURE DIVISION.

           MOVE 40 TO HOURS-WORKED
           MOVE 25 TO HOURLY-RATE
           COMPUTE GROSS-PAY = HOURS-WORKED * HOURLY-RATE
           DISPLAY GROSS-PAY
           STOP RUN.
