       IDENTIFICATION DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TABLE.
          05 WS-ELEM PIC 9(3) OCCURS 5.
       PROCEDURE DIVISION.
           MOVE 10 TO WS-ELEM(3)
           DISPLAY WS-ELEM(3).
