       IDENTIFICATION DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT PIC 9(5)V99.
       PROCEDURE DIVISION.
           MOVE 12345 TO WS-AMOUNT
           ADD 50 TO WS-AMOUNT
           DISPLAY WS-AMOUNT.