IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X PIC 9(4) VALUE 5.

PROCEDURE DIVISION.
    ADD 10 TO X.
    DISPLAY X.
    STOP RUN.