       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTIO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM PIC 9(5)V99 VALUE 0.
       01 WS-AMOUNT PIC 9(5)V99.
       FILE SECTION.
       FD INFILE.
       01 IN-RECORD PIC X(80).
       PROCEDURE DIVISION.
           OPEN INPUT INFILE.
           READ INFILE INTO IN-RECORD.
           MOVE 12345 TO WS-AMOUNT.
           ADD 0.50 TO WS-AMOUNT.
           DISPLAY WS-AMOUNT.
           CLOSE INFILE.
           STOP RUN.