       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT  PIC S9(5)V99 VALUE -99.
       01 WS-OUTPUT PIC S9(5)V99.
       01 WS-TABLE.
          05 WS-ELEM PIC S9(3) OCCURS 5.
       PROCEDURE DIVISION.
           COMPUTE WS-OUTPUT = WS-INPUT * 2
           MOVE 100 TO WS-ELEM(3)
           DISPLAY WS-OUTPUT
           DISPLAY WS-ELEM(3)
           .