       IDENTIFICATION DIVISION.
       PROGRAM-ID. PICTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AMOUNT PIC S9(5)V99.
       PROCEDURE DIVISION.
           MOVE 100 TO WS-AMOUNT
           DISPLAY WS-AMOUNT
           STOP RUN.
