IDENTIFICATION DIVISION.
PROGRAM-ID. IFTEST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X PIC 9(4) VALUE 7.

PROCEDURE DIVISION.
    IF X > 5
        DISPLAY X
    END-IF.
    STOP RUN.
