IDENTIFICATION DIVISION.
PROGRAM-ID. MOVETEST.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(4) VALUE 3.
01 B PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
    MOVE A TO B.
    DISPLAY B.
    STOP RUN.
