       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYTEST.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       COPY CUSTOMER.

       PROCEDURE DIVISION.

           MOVE 100 TO CUSTOMER-ID
           DISPLAY CUSTOMER-ID
           STOP RUN.