       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTPIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 CUSTOMER-ID PIC 9(10).
       01 BALANCE PIC S9(5)V99 COMP-3.

       PROCEDURE DIVISION.

           MOVE 100 TO CUSTOMER-ID
           DISPLAY CUSTOMER-ID
           STOP RUN.
